It is a technique used to encode categorical variables based on their relationship with the target variable. This encoding technique is useful when we have a categorical variable with a large number of unique categories, and we want to use this variable as a feature in our machine learning model.

In Target Guided Ordinal Encoding, we replace each category in the categorical variable with a numerical value based on the mean or median of the target variable for that category. This creates a monotonic relationship between the categorical variable and the target variable, which can improve the predictive power of our model.

In [1]:
import pandas as pd

# create a sample dataframe with categorical variables and target variable

df = pd.DataFrame({
    'city': ['New York', 'Los Angeles', 'Chicago', 'New York', 'Phoenix'],
    'price':[200, 150, 100, 120, 130]
})

In [2]:
df

          city  price
0     New York    200
1  Los Angeles    150
2      Chicago    100
3     New York    120
4      Phoenix    130

In [4]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [5]:
mean_price

{'Chicago': 100.0, 'Los Angeles': 150.0, 'New York': 160.0, 'Phoenix': 130.0}

In [6]:
df['city_encoded']=df['city'].map(mean_price)

In [7]:
df

          city  price  city_encoded
0     New York    200         160.0
1  Los Angeles    150         150.0
2      Chicago    100         100.0
3     New York    120         160.0
4      Phoenix    130         130.0

In [8]:
df[['city', 'city_encoded']]

          city  city_encoded
0     New York         160.0
1  Los Angeles         150.0
2      Chicago         100.0
3     New York         160.0
4      Phoenix         130.0